#include "stdafx.h"
#include<iostream>
#include <windows.h>
#include"ProRandomIntData.h"
#include"Menu.h"
#include "Sort.cpp"
#include "ReadWriteFile.h"
using namespace std;
void ProgramMainWindow()
{
	cout << endl << endl << endl;
	cout << "\t||===============================================================||" << endl;
	cout << "\t||=========================程序功能介绍==========================||" << endl;
	cout << "\t||---------------------------------------------------------------||" << endl;
	cout << "\t||     随机生成一定数量的整型数据，采用以下7种排序算法进行排序， ||" << endl;
	cout << "\t||对比分析各算法的排序效率。排序算法如下：                       ||" << endl;
	cout << "\t||         1、冒泡排序；2 选择排序；3 插入排序；4 堆排序；       ||" << endl;
	cout << "\t||         5、希尔排序；6 归并排序；7 快速排序.                  ||" << endl;	
	cout << "\t||---------------------------------------------------------------||" << endl;
	cout << "\t||                          按任意键继续                         ||" << endl;
	cout << "\t||===============================================================||" << endl;
	system("pause");
}
//程序操作窗口
void ProgramManipWindow()
{
	cout << endl << endl << endl;
	cout << "\t||===============================================================||" << endl;
	cout << "\t||=========================程序操作窗口==========================||" << endl;
	cout << "\t||---------------------------------------------------------------||" << endl;
	cout << "\t||     随机生成整型数据体，采用不同排序算法排序，对比排序效率    ||" << endl;
	cout << "\t||---------------------------------------------------------------||" << endl;
	cout << "\t||                           1: 开始排序过程                     ||" << endl;
	cout << "\t||                           0: 退出程序                         ||" << endl;
	cout << "\t||---------------------------------------------------------------||" << endl;
	cout << "\t||                           输入: 0 或 1                        ||" << endl;
	cout << "\t||===============================================================||" << endl;	
	//补充程序
	string str;
	cin >> str;
	int ad = atoi(str.c_str());	
	if (ad > 1 || ad < 0)ProgramManipWindow();
	/////////////////////////////////////////////////////////////////////////////////////
	if (ad == 1)
	{		
		/////////////////////////////////////////////////////////////////////////////////
		int rn;          //产生随机数的个数
		int* ra = NULL;  //随机数		
		int sm;          //排序算法
		char  SortMode;  //升序还是降序		
		/////////////////////////////////////////////////////////////////////////////////
		int mGetDataMethod;
		GetDataMethod(mGetDataMethod);
		if(mGetDataMethod)
		{		
			//输入产生随机数的个数
			InputRandomNum(rn);			
			try
			{
				ra = new int[rn];				
			}
			catch (bad_alloc & memExp)
			{
				cerr << memExp.what() << endl;
				//重新输入随机数个数
				InputRandomNum(rn);
			}
			//产生随机整数
			ProRandomIntData(ra, rn);
			//输入随机数保存的文件名
			string FileName; //文件名			
			InputRandomFileName(FileName);			
			//将随机数保存到FileName文件
			WriteFile(FileName, ra, rn,"未排序的数据");
			//选择排序算法
			SelectSortMethod(sm);
			//设置排序的方式(升序或降序)
			SetSortMode(SortMode);
			/////////////////////////////////////////////////////////////////////////////
			//调用排序函数
			cout << endl << endl << endl;
			cout << "\t||===============================================================||" << endl;
			cout << "\t||---------------------------------------------------------------||" << endl;
			cout << "\t||-------------------------正在排序......------------------------||" << endl;
			//获取排序前的系统时间
			long t1 = GetTickCount(); 	
			//初始化排序类对象
			CSort<int> object(ra, rn, sm, SortMode);
			//开始排序
			object.Sort();	
			//获取排序前的系统时间
			long t2 = GetTickCount(); 					
			cout << "\t||---------------------排序结束! 耗费时间：" << t2 - t1 << " MS" << endl;
			cout << "\t||---------------------------------------------------------------||" << endl;
			cout << "\t||===============================================================||" << endl;
			//输入排序结果的文件名 ，改为追加到同一个文件
			//InputSortResultFileName(FileName);
			//将排序结果保存到FileName文件
			WriteFile(FileName, object.GetData(), rn,"已排序的数据");	
			if (ra != NULL)delete[]ra;			
		}
		///////////////////////////////////////////////////////////////////////
		//返回主窗口
		system("pause");
		system("cls");
		ProgramManipWindow();
	}
	else
	{
		//退出程序
		return;
	}
}
//获取随机数的个数
void InputRandomNum(int& n)
{
	cout << endl << endl << endl;
	cout << "\t||===============================================================||" << endl;
	cout << "\t||---------------------------------------------------------------||" << endl;
	cout << "\t||                 输入产生随机数的个数n: <1--1亿>               ||" << endl;
	cout << "\t||---------------------------------------------------------------||" << endl;
	cout << "\t||===============================================================||" << endl;	
	string str;
	cin >> str;
	n = atoi(str.c_str());	
	if (n <= 0 || n >= INT_MAX)InputRandomNum(n);
}
//输入随机数保存的文件
void InputRandomFileName(string &str)
{
	cout << endl << endl << endl;
	cout << "\t||===============================================================||" << endl;
	cout << "\t||---------------------------------------------------------------||" << endl;
	cout << "\t||                   输入随机数保存的文件名:                     ||" << endl;
	cout << "\t||---------------------------------------------------------------||" << endl;
	cout << "\t||===============================================================||" << endl;
	cin >> str;
	if (str == "")InputRandomFileName(str);
	str += ".txt";
}
//输入排序结果的文件名
void InputSortResultFileName(string& str)
{
	cout << endl << endl << endl;
	cout << "\t||===============================================================||" << endl;
	cout << "\t||---------------------------------------------------------------||" << endl;
	cout << "\t||                 输入排序结果保存的文件名:                     ||" << endl;
	cout << "\t||---------------------------------------------------------------||" << endl;
	cout << "\t||===============================================================||" << endl;
	cin >> str;
	if (str == "")InputRandomFileName(str);
	str += ".txt";
}
//获取数据
void GetDataMethod(int& Method)
{
	cout << endl << endl << endl;
	cout << "\t||===============================================================||" << endl;
	cout << "\t||=========================获取数据方法==========================||" << endl;
	cout << "\t||---------------------------------------------------------------||" << endl;	
	cout << "\t||                       1: 产生随机整数                         ||" << endl;	
	cout << "\t||---------------------------------------------------------------||" << endl;
	cout << "\t||                       0: 返回上一级菜单                       ||" << endl;
	cout << "\t||===============================================================||" << endl;	
	string str;
	cin >> str;
	Method = atoi(str.c_str());	
	if (Method < 0 || Method>1)GetDataMethod(Method);
}
/////////////////////////////////////////////////////////////////////////////////////////
//选择排序算法
void SelectSortMethod( int &sm)
{
	cout << endl << endl << endl;
	cout << "\t||===============================================================||" << endl;
	cout << "\t||==========================选择排序算法=========================||" << endl;
	cout << "\t||---------------------------------------------------------------||" << endl;
	cout << "\t||                     可选择的排序算法<1--7>:                   ||" << endl;
	cout << "\t||                           1: 冒泡排序                         ||" << endl;
	cout << "\t||                           2: 选择排序                         ||" << endl;
	cout << "\t||                           3: 插入排序                         ||" << endl;
	cout << "\t||                           4: 堆排序                           ||" << endl;
	cout << "\t||                           5: 希尔排序                         ||" << endl;
	cout << "\t||                           6: 归并排序                         ||" << endl;
	cout << "\t||                           7: 快速排序                         ||" << endl;
	cout << "\t||---------------------------------------------------------------||" << endl;
	cout << "\t||                        0: 返回上一级菜单                      ||" << endl;
	cout << "\t||===============================================================||" << endl;	
	string str;
	cin >> str;
	sm = atoi(str.c_str());
	if (sm < 0 || sm>7)SelectSortMethod(sm);
}
//设置排序的方式(升序或降序)
void SetSortMode(char& SortMode)
{
	cout << endl << endl << endl;
	cout << "\t||===============================================================||" << endl;
	cout << "\t||==========================设置排序方式=========================||" << endl;
	cout << "\t||---------------------------------------------------------------||" << endl;	
	cout << "\t||                        1: 升序(从小到大)                      ||" << endl;
	cout << "\t||                        2: 降序(从大到小)                      ||" << endl;	
	cout << "\t||---------------------------------------------------------------||" << endl;	
	cout << "\t||===============================================================||" << endl;		
	string str;
	cin >> str;
	int ad = atoi(str.c_str());
	if (ad < 1 || ad > 2)SetSortMode(SortMode);
	if (ad == 1)SortMode = '<';
	else        SortMode = '>';
}