#include "stdafx.h"
#include <fstream>
#include <iomanip>
#include <iostream>
#include "ReadWriteFile.h"
using namespace std;

void WriteFile(string &FileName, int* a, int n,const string &s)
{
	/////////////////////////////////////////////////////////////////////////////////////
	//将排序结果输出到文件
	cout << endl << endl << endl;
	cout << "\t||===============================================================||" << endl;
	cout << "\t||---------------------------------------------------------------||" << endl;
	cout << "\t||--------------------------正在保存文件-------------------------||" << endl;
	ofstream output;
	//补充程序
	output.open(FileName,ios::app);
	output << s << endl;
	for (int i = 0; i < n; i++)
	{
		output <<setw(20)<< i + 1 << setw(25) << a[i] << endl;
	}
	output<< "===============================================================" << endl;
	output.close();
	cout << "\t||----------------数据保存在 " << FileName << " 文件中" << endl;
	cout << "\t||---------------------------------------------------------------||" << endl;
	cout << "\t||===============================================================||" << endl;
	/////////////////////////////////////////////////////////////////////////////////////	
}

